<center><font size=6 color="#00416d">Merging Joining Concatenating</font></center>

In [1]:
import pandas as pd

## Importing datasets

In [2]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week1.head(5)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [3]:
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
week2.head(5)

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [4]:
customers = pd.read_csv("Restaurant - Customers.csv")
customers.head(5)

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
2   3      Roger     Black    Male  Tagfeed              Account Executive
3   4     Steven     Evans    Male     Fatz               Registered Nurse
4   5       Judy  Morrison  Female  Demivee                Legal Assistant

In [5]:
foods = pd.read_csv("Restaurant - Foods.csv")
foods.head(5)

   Food ID   Food Item  Price
0        1       Sushi   3.99
1        2     Burrito   9.99
2        3        Taco   2.99
3        4  Quesadilla   4.25
4        5       Pizza   2.49

## pd.concat()
Documentation: <a href="https://pandas.pydata.org/docs/reference/api/pandas.concat.html"> pandas.concat </a> <br>
Defination: Concatenate pandas objects along a particular axis with optional set logic along the other axes.

In [6]:
pd.concat(objs=[week1, week2], # Objects to concate
          ignore_index=True, # It will reset the index
         )

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
495          783       10
496          556       10
497          547        9
498          252        9
499          249        6

[500 rows x 2 columns]

In [8]:
# Sometimes index plays a vital role, to generate a meaningful index we can do like below
data = pd.concat(objs=[week1, week2], # Objects to concate
          keys = ["week 1", "week 2"], # Creating multi index
         )
data

            Customer ID  Food ID
week 1 0            537        9
       1             97        4
       2            658        1
       3            202        2
       4            155        9
...                 ...      ...
week 2 245          783       10
       246          556       10
       247          547        9
       248          252        9
       249          249        6

[500 rows x 2 columns]

In [9]:
# Accessing data
data.loc[("week 2",)]
data.loc[("week 2", [247, 248]),]
data.loc[("week 2", [247, 248]), "Customer ID"]

week 2  247    547
        248    252
Name: Customer ID, dtype: int64

## df.merging()

<strong>Task:</strong><br>
Find the customers who visited restaurent in week-1 and week-2

<strong>Solution:</strong><br>
We are going to fetch those rows by performing inner join <br>
<img src="inner-join.jpg" alt="inner-join" style="width:200px;"/>

In [10]:
week1.merge(week2,
            how="inner", 
            on="Customer ID", # This only works when we have common column name
            suffixes = ['-week1', '-week2'] # By default it has _x and _y
           )

    Customer ID  Food ID-week1  Food ID-week2
0           537              9              5
1           155              9              3
2           155              1              3
3           503              5              8
4           503              5              9
..          ...            ...            ...
57          945              5              4
58          343              3              5
59          343              3              2
60          343              3              7
61          621              9              6

[62 rows x 3 columns]

In [11]:
# To fetch customer who came in first week and came in second week and order same food item
week1.merge(week2,
            how = "inner",
            on = ["Customer ID", "Food ID"], # So customer ID and Food ID should be common in both columns
           )

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4
5           21        4
6          922        1
7          578        5
8          578        5

### outer join()

Outer join fetches all customer who visited the restraurent in week1, week2 and both

<img src="outer_join.png" alt="outer_join" style="width:400px;"/>

In [12]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")

In [13]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [14]:
week2.head(2)

   Customer ID  Food ID
0          688       10
1          813        7

In [15]:
data = week1.merge(week2,
            how="outer",
            on="Customer ID", 
            indicator=True, # Tell us from which join data was fetched
           )
data.head()

   Customer ID  Food ID_x  Food ID_y     _merge
0          537        9.0        5.0       both
1           97        4.0        NaN  left_only
2          658        1.0        NaN  left_only
3          202        2.0        NaN  left_only
4          155        9.0        3.0       both

In [16]:
#To fetch unique customers in from 2 weeks
mask = data["_merge"].isin(["left_only", "right_only"])
data[mask]

     Customer ID  Food ID_x  Food ID_y      _merge
1             97        4.0        NaN   left_only
2            658        1.0        NaN   left_only
3            202        2.0        NaN   left_only
6            213        8.0        NaN   left_only
7            600        1.0        NaN   left_only
..           ...        ...        ...         ...
449          855        NaN        4.0  right_only
450          559        NaN       10.0  right_only
451          276        NaN        4.0  right_only
452          556        NaN       10.0  right_only
453          252        NaN        9.0  right_only

[392 rows x 4 columns]

## Left Join

The LEFT JOIN keyword returns all records from the left table (table1), and the matching records from the right table (table2). The result is 0 records from the right side, if there is no match

<img src="LEFT-JOIN.png" alt="LEFT-JOIN.pngEFT-JOIN" style="width:400px;"/>

Goal: To fetch all food items related info for "FOOD ID" column in week1 data frame

In [29]:
week1 = pd.DataFrame({"Customer ID": [1, 2, 3, 4, 5, 6], "Food ID": [22, 23, 24, 25, 43, 34]})
foods = pd.DataFrame({"Customer ID": [1, 2, 10, 23, 2, 10], 
                      "Food ID": [22, 23, 24, 25, 43, 23],
                      "Sex":["M", "M", "F", "M", "F", "F"]})

In [30]:
week1.head()

   Customer ID  Food ID
0            1       22
1            2       23
2            3       24
3            4       25
4            5       43

In [33]:
foods.head(6)

   Customer ID  Food ID Sex
0            1       22   M
1            2       23   M
2           10       24   F
3           23       25   M
4            2       43   F
5           10       23   F

In [34]:
week1.merge(foods, how="left", on="Food ID", sort=True, indicator=True)

   Customer ID_x  Food ID  Customer ID_y  Sex     _merge
0              1       22            1.0    M       both
1              2       23            2.0    M       both
2              2       23           10.0    F       both
3              3       24           10.0    F       both
4              4       25           23.0    M       both
5              6       34            NaN  NaN  left_only
6              5       43            2.0    F       both

### Perform left join when we have different columns

In [21]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [22]:
customers = pd.read_csv("Restaurant - Customers.csv")
customers.head(5)

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
2   3      Roger     Black    Male  Tagfeed              Account Executive
3   4     Steven     Evans    Male     Fatz               Registered Nurse
4   5       Judy  Morrison  Female  Demivee                Legal Assistant

In above 2 data frames ID and Customer ID are same. We have to join based on that

In [23]:
week1.merge(customers, how="left",
            left_on = "Customer ID", # We are saying use Customer ID from week1 dataframe for left merge
            right_on = "ID", # We are saying use ID from customers dataframe for left merge
            sort = True,).drop("ID", axis=1)

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,3,2,Roger,Black,Male,Tagfeed,Account Executive
1,10,2,Steven,Ryan,Male,Twinder,Community Outreach Specialist
2,20,1,Lisa,Rice,Female,Oloo,Programmer IV
3,21,4,Albert,Burns,Male,Rhynoodle,Junior Executive
4,21,4,Albert,Burns,Male,Rhynoodle,Junior Executive
...,...,...,...,...,...,...,...
245,966,5,Robert,Ford,Male,Jabbertype,Account Representative IV
246,968,1,Teresa,Reynolds,Female,Flashdog,Budget/Accounting Analyst IV
247,985,5,Julia,Ortiz,Female,Kwideo,Structural Analysis Engineer
248,991,2,Melissa,Wells,Female,Lazzy,Senior Sales Associate
249,1000,2,Brian,Daniels,Male,Tazzy,Physical Therapy Assistant

### merging data frames based on the index

In this example we will merge week1, customers and foods table

In [ ]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv", index_col="ID")
foods = pd.read_csv("Restaurant - Foods.csv", index_col="Food ID")

In [ ]:
customers.head()

In [ ]:
foods.head()

In [ ]:
# Merging customers, foods, week1
sales = week1.merge(customers, how="left", left_on="Customer ID", right_index=True)
sales.merge(foods, how="left", left_on="Food ID", right_index=True)

In [ ]:
# Example 2
week1.merge(week2, how="left", left_index=True, right_index=True, suffixes=["-week1", "-week2"])

### .join() method

In [ ]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
satisfaction = pd.read_csv("Restaurant - Week 1 Satisfaction.csv")

In [ ]:
week1.head()

In [ ]:
satisfaction.head()

In [ ]:
# Based on the index it will merge the 2 data frames
week1.join(satisfaction)

In [ ]:
# which is equal to,
week1.merge(satisfaction, how="left", left_index=True, right_index=True)

### pd.merge()

It is similar to df.merge execept the first 2 arguments in pd.merge() are 2 data frames